<a href="https://colab.research.google.com/github/Mehadi2012/Data-Science-in-Practice/blob/main/DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [8]:
import pandas as pd
record1 = pd.Series({'Name':'Alice',
                    'Class': 'Physics',
                    'Score': '85'})
record2 = pd.Series({'Name':'Jack',
                    'Class': 'Chemistry',
                    'Score': '80'})
reocrd3 = pd.Series({'Name':'Helen',
                    'Class': 'Biology',
                    'Score': '90'})  

record1

Name       Alice
Class    Physics
Score         85
dtype: object

In [9]:
df = pd.DataFrame([record1,record2,reocrd3], index = ['school1','school2','school3'])
df.head()

          Name      Class Score
school1  Alice    Physics    85
school2   Jack  Chemistry    80
school3  Helen    Biology    90

In [63]:
students = [{'Name':'Alice',
                    'Class': 'Physics',
                    'Score': '85'},
           {'Name':'Jack',
                    'Class': 'Chemistry',
                    'Score': '80'},
           {'Name':'Helen',
                    'Class': 'Biology',
                    'Score': '90'}]
      
df = pd.DataFrame(students, index = ['school1','school2','school1'])
df.head()

          Name      Class Score
school1  Alice    Physics    85
school2   Jack  Chemistry    80
school1  Helen    Biology    90

In [29]:
df.loc['school2']

Name          Jack
Class    Chemistry
Score           80
Name: school2, dtype: object

In [30]:
df.iloc[1]

Name          Jack
Class    Chemistry
Score           80
Name: school2, dtype: object

In [31]:
type(df.loc['school1'])

pandas.core.frame.DataFrame

In [32]:
df.T   # This pivots all of the rows into columns and all of the columns into rows

       school1    school2  school1
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         80       90

In [33]:
df.T.loc['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [34]:
df['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [35]:
type(df['Name'])

pandas.core.series.Series

In [36]:
df.loc['school1']['Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [38]:
print(type(df.loc['school1']))
print(type(df.loc['school1']['Name']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [45]:
a= df.loc['school1']
b =df.loc['school1']['Name']
print(a.shape)
print(b.shape)
print(a.ndim)
print(b.ndim)

(2, 3)
(2,)
2
1

In [46]:
df.loc[:,['Name','Score']]

          Name Score
school1  Alice    85
school2   Jack    80
school1  Helen    90

In [64]:
df.drop('school1')

         Name      Class Score
school2  Jack  Chemistry    80

In [65]:
df.head()         # so drop function doesn't bring any changes to the original dataFrame. it only returns a copy of dataFrame with the given rows/column removed.

          Name      Class Score
school1  Alice    Physics    85
school2   Jack  Chemistry    80
school1  Helen    Biology    90

In [56]:
copy_df = df.copy()    
copy_df.head()

          Name      Class Score
school1  Alice    Physics    85
school2   Jack  Chemistry    80
school1  Helen    Biology    90

In [57]:
copy_df.drop("Name", inplace =True,  axis=1)
copy_df

             Class Score
school1    Physics    85
school2  Chemistry    80
school1    Biology    90

In [59]:
del copy_df['Class']
copy_df

        Score
school1    85
school2    80
school1    90

In [67]:
df['Class'] = None
df

          Name Class Score
school1  Alice  None    85
school2   Jack  None    80
school1  Helen  None    90